package com.company.lesson_05;
/* 10 чисел наоборот
Вывести на экран числа от 10 до 1 используя цикл while.
*/
public class Test_03
{
    public static void main(String[] args) {

       int a = 10;
       while(a >= 0){
           System.out.println(a);
           a--;
       }
    }
}
