package com.company.HW.Home_work_08Massiv;

import java.util.Arrays;

//Создайте массив из всех чётных чисел от 2 до 30 и выведите элементы массива на экран.
public class Test_02 {
    public static void main(String[] args) {
        int[] x = new int[]{2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30};

        System.out.println(Arrays.toString(x));
    }
}
