package com.company.lesson_18;

import java.util.ArrayList;
import java.util.List;

// Задача по алгоритмам.
// Есть массив чисел, в котором все числа дублируются, кроме одного. Найдите число, которое не имеет дубликатов в массиве.
// Пример ввода:
// {123456789, 65475264, 836133896, 836133896, 746254373, 1000000000,
//  542627588, 1000000000, 444088605, 65475264, 746254373, 542627588, 444088605}
// Пример вывода:
// 123456789
// TODO: 19.05.2019  
public class Test_01 {
    public static void main(String[] args) {
        int[] x = new int[]{123456789, 65475264, 836133896, 836133896, 746254373, 1000000000, 542627588, 1000000000, 444088605, 65475264, 746254373, 542627588, 444088605};
        int first = x[0];
        for (int i = 0; i < x.length; i++) {
            if (x[i] == x[0]){

            }
            }
        }
    }



